RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
        __errorcontrol = 1;

        // Execute SYSRESETREQ via AIRCR
        Write32(AIRCR_Addr, 0x05FA0004);

        __errorcontrol = 0;

        // Give bootloader time to do what it needs to do
        DAP_Delay(BootTime);  // try 10ms
      </block>
          <block>
        Sequence("WaitForStopAfterReset");
      </block>
        </sequence>
        <sequence name="ResetProcessorCore1">
          <block>
        __var SYSCON_NS_Base_Addr = 0x40000000;
        __var CPUCTRL_Addr        = SYSCON_NS_Base_Addr + 0x800;
        __var value               = 0;
        __var apOrg               = __ap;

        __ap = 0;                           // Switch to CPU0 AP to drive CPU1 reset via CPUCTRL register

        value      = Read32(CPUCTRL_Addr);  // Read CPUCTRL Register
        value &amp;= 0x0000FFFF;            // Preserve previous settings
        value     |= 0xC0C40000;            // Set key value
        value     |= 0x00000028;            // Set CPU1CLKEN and CPU1RSTEN
        Write32(CPUCTRL_Addr, value);       // Put CPU1 into reset

        value &amp;= ~0x00000020;           // Clear CPU1RSTEN
        Write32(CPUCTRL_Addr, value);       // Release CPU1 from reset

        __ap = apOrg;
      </block>
        </sequence>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>
          Sequence("EnableTraceClk");       // Enable and configure trace clock
        </block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_10">
              <block>
            Write32(0x40001028, 0x00000046); // Configure PIO0_10: FUNC - 6, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
          </block>
            </control>
            <control if="SWO_Pin == 1" info="SWO via PIO0_8">
              <block>
            Write32(0x40001020, 0x00000044); // Configure PIO0_10: FUNC - 4, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
          </block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/LPC55S69/arm/LPC55xx.dbgconf">
  // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
  __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO0_10, 1 = PIO0_8
  __var Dbg_CR                = 0x00000000;           // DBG_CR
  __var BootTime              = 10000;                // 10 milliseconds
</debugvars>
      <description>High Efficiency Arm Cortex-M33-based Microcontroller</description>
      <device Dname="LPC55S69">
        <processor Pname="cm33_core0" Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="150000000"/>
        <processor Pname="cm33_core1" Dcore="Cortex-M33" Dfpu="NO_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="150000000"/>
        <environment Pname="cm33_core0" name="iar">
          <file category="linkerfile" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_flash.icf"/>
        </environment>
        <environment Pname="cm33_core1" name="iar">
          <file category="linkerfile" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_flash.icf"/>
        </environment>
        <sequences>
          <sequence name="DebugDeviceUnlock" Pname="cm33_core0">
            <block>
          Sequence("DebugDeviceUnlockCore0");
      </block>
          </sequence>
          <sequence name="DebugDeviceUnlock" Pname="cm33_core1" disable="1"/>
          <sequence name="ResetCatchSet" Pname="cm33_core0">
            <block>
          Sequence("ResetCatchSetCore0");
      </block>
          </sequence>
          <sequence name="ResetCatchSet" Pname="cm33_core1">
            <block>
          Sequence("ResetCatchSetCore1");
      </block>
          </sequence>
          <sequence name="ResetSystem" Pname="cm33_core0">
            <block>
          Sequence("ResetSystemCore0");
      </block>
          </sequence>
          <sequence name="ResetSystem" Pname="cm33_core1" disable="1"/>
          <sequence name="ResetProcessor" Pname="cm33_core0" disable="1"/>
          <sequence name="ResetProcessor" Pname="cm33_core1">
            <block>
          Sequence("ResetProcessorCore1");
      </block>
          </sequence>
        </sequences>
        <memory name="BootROM" start="0x03000000" size="0x020000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x020000" access="rx" alias="BootROM"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x09d800" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH_alias" start="0x10000000" size="0x09d800" access="rw" alias="PROGRAM_FLASH"/>
        <memory name="SRAM" start="0x20000000" size="0x040000" access="rw" default="1"/>
        <memory name="SRAM4" start="0x20040000" size="0x4000" access="rw" default="1"/>
        <memory name="SRAM4_alias" start="0x30040000" size="0x4000" access="rw" alias="SRAM4"/>
        <memory name="SRAMX" start="0x04000000" size="0x8000" access="rw" default="1"/>
        <memory name="SRAMX_alias" start="0x14000000" size="0x8000" access="rw" alias="SRAMX"/>
        <memory name="SRAM_alias" start="0x30000000" size="0x040000" access="rw" alias="SRAM"/>
        <memory name="USB_RAM" start="0x40100000" size="0x4000" access="rw" default="1"/>
        <memory name="USB_RAM_alias" start="0x50100000" size="0x4000" access="rw" alias="USB_RAM"/>
        <algorithm name="devices/LPC55S69/arm/LPC55XX_640.FLM" start="0x00000000" size="0x00098000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="devices/LPC55S69/arm/LPC55XX_S_640.FLM" start="0x10000000" size="0x00098000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/LPC55S69/LPC55S69_cm33_core0.xml" Pname="cm33_core0" __dp="0" __ap="0"/>
        <debug svd="devices/LPC55S69/LPC55S69_cm33_core1.xml" Pname="cm33_core1" __dp="0" __ap="1"/>
        <variant Dvariant="LPC55S69JBD100">
          <compile Pname="cm33_core0" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JBD100_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JBD100_cm33_core1"/>
        </variant>
        <variant Dvariant="LPC55S69JEV98">
          <compile Pname="cm33_core0" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JEV98_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JEV98_cm33_core1"/>
        </variant>
        <variant Dvariant="LPC55S69JBD64">
          <compile Pname="cm33_core0" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JBD64_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JBD64_cm33_core1"/>
        </variant>
        <variant Dvariant="LPC55S69JEV59">
          <compile Pname="cm33_core0" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JEV59_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/LPC55S69/fsl_device_registers.h" define="CPU_LPC55S69JEV59_cm33_core1"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device_id.LPC55S69.internal_condition">
      <accept Dname="LPC55S69JBD100" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV59" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV98" Dvendor="NXP:11"/>
    </condition>
