RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="DEVICES_Project_Template.LPC55S69.condition_id">
      <require condition="allOf.component.usart_adapter, device_id=LPC55S69, device.LPC55S69_startup, driver.clock, driver.common, driver.flexcomm_i2c, driver.flexcomm_spi, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, driver.power, driver.reset, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, device_id=LPC55S69, device.LPC55S69_startup, driver.clock, driver.common, driver.flexcomm_i2c, driver.flexcomm_spi, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, driver.power, driver.reset, anyOf=allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require condition="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, utility.assert, utility.debug_console, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, utility.assert, utility.debug_console.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="RTE_Device.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.lpc_dma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC55S69, driver.lpc_dma.internal_condition">
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC55S69.internal_condition">
      <accept Dname="LPC55S69JBD100" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV59" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV98" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.device=LPC55S69.internal_condition">
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.audio_flexcomm_i2s_dma_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_i2s_dma, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_i2s_dma, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s_dma"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.lpc_gpio_adapter, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.timer_manager, anyOf=component.lpc_gpio_adapter, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.component.lpc_gpio_adapter.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.component.lpc_gpio_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter.internal_condition"/>
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.codec, component.wm8904_adapter, allOf=driver.codec, component.wm8960_adapter, allOf=driver.codec, component.sgtl_adapter, allOf=driver.codec, component.da7212_adapter, allOf=driver.codec, component.cs42888_adapter.internal_condition">
      <accept condition="allOf.driver.codec, component.wm8904_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.wm8960_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.sgtl_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.da7212_adapter.internal_condition"/>
      <accept condition="allOf.driver.codec, component.cs42888_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.codec, component.wm8904_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
    </condition>
