RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="allOf.driver.codec, component.wm8960_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.sgtl_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.da7212_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
    </condition>
    <condition id="allOf.driver.codec, component.cs42888_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.driver.common, anyOf=component.flexcomm_i2c_adapter, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.flexcomm_i2c_adapter, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.flexcomm_i2c_adapter.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.component.flexcomm_i2c_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.driver.cs42888, driver.codec, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.cs42888, driver.codec, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.common, driver.ctimer, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.ctimer, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.driver.dialog7212, driver.codec, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dialog7212, driver.codec, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_i2c_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_i2c, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_spi, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_spi, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.gint_adapter.condition_id">
      <require condition="allOf.driver.gint, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gint, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gint"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.lpc_gpio_adapter, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
