RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="component.log.backend.debugconsole_lite.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console_lite, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console_lite, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.driver.common, component.log, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.lpc_crc_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpc_crc, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpc_crc, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.lpc_gpio_adapter.condition_id">
      <require condition="allOf.driver.lpc_gpio, driver.inputmux, driver.pint, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_gpio, driver.inputmux, driver.pint, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pint"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.lpcrtc.condition_id">
      <require condition="allOf.driver.common, driver.lpc_rtc, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpc_rtc, device_id=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.driver.common, component.lists, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.mflash.common.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.mflash.lpc55xxx.condition_id">
      <require condition="allOf.component.mflash.common, device_id=LPC55S69, driver.iap1.internal_condition"/>
    </condition>
    <condition id="allOf.component.mflash.common, device_id=LPC55S69, driver.iap1.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_common"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iap1"/>
    </condition>
    <condition id="component.mflash_dummy.condition_id">
      <require condition="allOf.component.mflash_file, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.component.mflash_file, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_file"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.mflash_file.condition_id">
      <require condition="anyOf.component.mflash.lpc55xxx.internal_condition"/>
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mflash.lpc55xxx.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpc55xxx"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.common, driver.mrt, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mrt, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.common, driver.ostimer, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.ostimer, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.pwm_ctimer_adapter.condition_id">
      <require condition="allOf.driver.common, driver.ctimer, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
