RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_swo, component.serial_manager_spi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.component.serial_manager, anyOf=allOf=driver.flexcomm_spi, component.flexcomm_spi_adapter, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, anyOf=allOf=driver.flexcomm_spi, component.flexcomm_spi_adapter, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.allOf=driver.flexcomm_spi, component.flexcomm_spi_adapter.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.flexcomm_spi, component.flexcomm_spi_adapter.internal_condition">
      <accept condition="allOf.driver.flexcomm_spi, component.flexcomm_spi_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_spi, component.flexcomm_spi_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.core=cm33, driver.common, component.serial_manager, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm33, driver.common, component.serial_manager, device=LPC55S69.internal_condition">
      <require condition="core.cm33.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="core.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.usart_adapter, component.serial_manager, anyOf=driver.flexcomm_usart, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, component.serial_manager, anyOf=driver.flexcomm_usart, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.driver.flexcomm_usart.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.flexcomm_usart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.driver.sgtl5000, driver.codec, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sgtl5000, driver.codec, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.ctimer_adapter, component.mrt_adapter, component.ostimer_adapter, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.ctimer_adapter, component.mrt_adapter, component.ostimer_adapter, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.ctimer_adapter, component.mrt_adapter, component.ostimer_adapter.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
