RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="anyOf.component.ctimer_adapter, component.mrt_adapter, component.ostimer_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
    </condition>
    <condition id="component.usart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_usart, driver.flexcomm, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_usart, driver.flexcomm, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.usart_dma_adapter.condition_id">
      <require condition="allOf.component.usart_adapter, component.timer_manager, driver.flexcomm_usart_dma, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, component.timer_manager, driver.flexcomm_usart_dma, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.driver.wm8904, driver.codec, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8904, driver.codec, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.driver.wm8960, driver.codec, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.wm8960, driver.codec, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="device.LPC55S69_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device_id=LPC55S69.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33, core_ids=cm33_core0, cm33_core1.condition_id">
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0, cm33_core1.internal_condition"/>
    </condition>
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="core_ids.cm33_core0, cm33_core1.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="allOf.cores=cm33, core_ids=cm33_core0.condition_id">
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core0.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
    </condition>
    <condition id="allOf.cores=cm33, core_ids=cm33_core1.condition_id">
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core1.internal_condition">
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="device.LPC55S69_linker.condition_id">
      <require condition="allOf.device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC55S69.internal_condition">
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="device_ids.LPC55S69.internal_condition">
      <accept Dname="LPC55S69JBD100" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV59" Dvendor="NXP:11"/>
      <accept Dname="LPC55S69JEV98" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.LPC55S69.internal_condition"/>
    </condition>
    <condition id="device.LPC55S69_startup.condition_id">
      <require condition="allOf.device.LPC55S69_system, device=LPC55S69.internal_condition"/>
    </condition>
