RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="allOf.device.LPC55S69_system, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC55S69_system"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="device.LPC55S69_system.condition_id">
      <require condition="allOf.device.LPC55S69_CMSIS, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.device.LPC55S69_CMSIS, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC55S69_header"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.anactrl.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC55S69, driver.common.internal_condition">
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.casper.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.anyOf=driver.power, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.power, driver.common, device=LPC55S69.internal_condition">
      <require condition="anyOf.driver.power.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.power.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
    </condition>
    <condition id="driver.cmp_1.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_i2c.condition_id">
      <require condition="allOf.driver.flexcomm_i2c_dma, CMSIS_Driver_Include.I2C, RTE_Device, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2c_dma, CMSIS_Driver_Include.I2C, RTE_Device, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_spi.condition_id">
      <require condition="allOf.driver.flexcomm_spi_dma, CMSIS_Driver_Include.SPI, RTE_Device, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_spi_dma, CMSIS_Driver_Include.SPI, RTE_Device, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_flexcomm_usart.condition_id">
      <require condition="allOf.driver.flexcomm_usart_dma, CMSIS_Driver_Include.USART, RTE_Device, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_usart_dma, CMSIS_Driver_Include.USART, RTE_Device, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, anyOf=component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters.internal_condition"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
