RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="anyOf.component.wm8904_adapter, component.wm8960_adapter, component.sgtl_adapter, component.da7212_adapter, component.cs42888_adapter, component.codec_adapters.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.reset, driver.clock, device.LPC55S69_CMSIS, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.reset, driver.clock, device.LPC55S69_CMSIS, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC55S69_header"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c.condition_id">
      <require condition="allOf.driver.flexcomm, driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, driver.common, device_id=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, driver.flexcomm, driver.common, driver.flexcomm_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, driver.flexcomm, driver.common, driver.flexcomm_i2c, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s.condition_id">
      <require condition="allOf.driver.flexcomm, driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, driver.flexcomm_i2s, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, driver.flexcomm_i2s, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi.condition_id">
      <require condition="allOf.driver.flexcomm, driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, driver.flexcomm, driver.flexcomm_spi, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, driver.flexcomm, driver.flexcomm_spi, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart.condition_id">
      <require condition="allOf.driver.flexcomm, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, device_id=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart_dma.condition_id">
      <require condition="allOf.driver.lpc_dma, driver.flexcomm, driver.flexcomm_usart, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_dma, driver.flexcomm, driver.flexcomm_usart, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
