RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="driver.fro_calib.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=LPC55S69.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.gint.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.hashcrypt.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.iap1.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common, driver.inputmux_connections.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC55S69, driver.common, driver.inputmux_connections.internal_condition">
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iocon.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpc_rtc.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mailbox.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.nand_flash-common.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.nor_flash-common.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.plu.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.powerquad.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.prince.condition_id">
      <require condition="allOf.driver.iap1, driver.puf, device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.driver.iap1, driver.puf, device_id=LPC55S69, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iap1"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="PUF"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.puf.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.rng_1.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
