RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sdif.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.sysctl.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.utick.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.wm8904.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.wm8960.condition_id">
      <require condition="allOf.driver.common, component.codec_i2c, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="driver.wwdt.condition_id">
      <require condition="allOf.device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.usart_adapter, device_id=LPC55S69, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, device_id=LPC55S69, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device_id.LPC55S69.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="utility.incbin.condition_id">
      <require condition="allOf.device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.utility.str, component.lists, driver.common, device=LPC55S69.internal_condition"/>
    </condition>
    <condition id="allOf.utility.str, component.lists, driver.common, device=LPC55S69.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S69.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=LPC55S69.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC55S69" Cversion="1.0.0" condition="DEVICES_Project_Template.LPC55S69.condition_id" isDefaultVariant="1">
      <description>Devices_project_template LPC55S69</description>
      <files>
        <file category="header" attr="config" name="devices/LPC55S69/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC55S69/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC55S69/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC55S69/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC55S69/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC55S69/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC55S69/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC55S69/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC55S69/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="RTE_Device.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/LPC55S69/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC55S69/template/"/>
      </files>
    </component>
