RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="cmake_toolchain" Cversion="1.0.0" condition="cmake_toolchain.condition_id">
      <description>Cmake_toolchain</description>
      <files>
        <file category="other" name="tools/cmake_toolchain_files/armgcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xclang.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/armgcc_force_cpp.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/mcux_config.cmake" projectpath="cmake_toolchain_files"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="audio_flexcomm_i2s_dma_adapter" Cversion="1.0.0" condition="component.audio_flexcomm_i2s_dma_adapter.condition_id">
      <description>Component flexcomm_i2s_dma_adapter</description>
      <files>
        <file category="header" name="components/audio/fsl_adapter_audio.h" projectpath="component/audio"/>
        <file category="sourceC" name="components/audio/fsl_adapter_flexcomm_i2s.c" projectpath="component/audio"/>
        <file category="include" name="components/audio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="button" Cversion="1.0.0" condition="component.button.condition_id">
      <description>Component button</description>
      <files>
        <file category="header" name="components/button/fsl_component_button.h" projectpath="component/button"/>
        <file category="sourceC" name="components/button/fsl_component_button.c" projectpath="component/button"/>
        <file category="include" name="components/button/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters" Cversion="2.2.0" condition="component.codec_adapters.condition_id">
      <description>Component codec adapters for multi codec</description>
      <RTE_Components_h>
#ifndef CODEC_MULTI_ADAPTERS
#define CODEC_MULTI_ADAPTERS 1
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/codec/port/fsl_codec_adapter.c" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="component.codec_i2c.condition_id">
      <description>Component codec_i2c</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c" projectpath="codec"/>
        <file category="include" name="components/codec/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter" Cversion="2.2.1" condition="component.cs42888_adapter.condition_id">
      <description>Component cs42888 adapter for single codec</description>
      <files>
        <file category="sourceC" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.c" projectpath="codec/port/cs42888"/>
        <file category="header" name="components/codec/port/cs42888/fsl_codec_cs42888_adapter.h" projectpath="codec/port/cs42888"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/cs42888/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter" Cversion="1.0.0" condition="component.ctimer_adapter.condition_id">
      <description>Component ctimer_adapter</description>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ctimer.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter" Cversion="2.2.0" condition="component.da7212_adapter.condition_id">
      <description>Component da7212 adapter for single codec</description>
      <files>
        <file category="sourceC" name="components/codec/port/da7212/fsl_codec_da7212_adapter.c" projectpath="codec/port/da7212"/>
        <file category="header" name="components/codec/port/da7212/fsl_codec_da7212_adapter.h" projectpath="codec/port/da7212"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/da7212/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter" Cversion="1.0.0" condition="component.flexcomm_i2c_adapter.condition_id">
      <description>Component flexcomm_i2c_adapter</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h" projectpath="component/i2c"/>
        <file category="sourceC" name="components/i2c/fsl_adapter_flexcomm_i2c.c" projectpath="component/i2c"/>
        <file category="include" name="components/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter" Cversion="1.0.0" condition="component.flexcomm_spi_adapter.condition_id">
      <description>Component flexcomm_spi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h" projectpath="component/spi"/>
        <file category="sourceC" name="components/spi/fsl_adapter_flexcomm_spi.c" projectpath="component/spi"/>
        <file category="include" name="components/spi/"/>
      </files>
    </component>
