RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma_adapter" Cversion="1.0.0" condition="component.usart_dma_adapter.condition_id">
      <description>Component usart_dma_adapter</description>
      <RTE_Components_h>
#ifndef HAL_UART_DMA_ENABLE
#define HAL_UART_DMA_ENABLE 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC55S69_header" Cversion="1.0.0" condition="device.LPC55S69_CMSIS.condition_id">
      <description>Device LPC55S69_cmsis</description>
      <files>
        <file condition="allOf.cores=cm33, core_ids=cm33_core0, cm33_core1.condition_id" category="header" name="devices/LPC55S69/fsl_device_registers.h" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core0.condition_id" category="header" name="devices/LPC55S69/LPC55S69_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core0.condition_id" category="header" name="devices/LPC55S69/LPC55S69_cm33_core0_features.h" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core1.condition_id" category="header" name="devices/LPC55S69/LPC55S69_cm33_core1.h" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core1.condition_id" category="header" name="devices/LPC55S69/LPC55S69_cm33_core1_features.h" projectpath="device"/>
        <file condition="allOf.cores=cm33.condition_id" category="include" name="devices/LPC55S69/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC55S69_linker" Cversion="1.0.0" condition="device.LPC55S69_linker.condition_id">
      <description>Device LPC55S69_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core0_flash.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core0_flash_ns.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core0_flash_s.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core0_ram.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core1_flash.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core1_ram.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/arm/LPC55S69_cm33_core1_ram_s.scf" version="1.0.0" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core0_flash.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core0_flash_ns.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core0_flash_s.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core0_ram.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core1_flash.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core1_ram.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/gcc/LPC55S69_cm33_core1_ram_s.ld" version="1.0.0" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_flash.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_flash_ns.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_flash_s.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core0_ram.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core1_flash.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core1_ram.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=LPC55S69.condition_id" category="linkerScript" attr="config" name="devices/LPC55S69/iar/LPC55S69_cm33_core1_ram_s.icf" version="1.0.0" projectpath="LPC55S69/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.1.0" condition="device.LPC55S69_startup.condition_id">
      <description>Device LPC55S69_startup</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/LPC55S69/arm/startup_LPC55S69_cm33_core0.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/LPC55S69/arm/startup_LPC55S69_cm33_core1.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0.condition_id" category="sourceAsm" name="devices/LPC55S69/gcc/startup_LPC55S69_cm33_core0.S" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1.condition_id" category="sourceAsm" name="devices/LPC55S69/gcc/startup_LPC55S69_cm33_core1.S" projectpath="startup"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/LPC55S69/iar/startup_LPC55S69_cm33_core0.s" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/LPC55S69/iar/startup_LPC55S69_cm33_core1.s" version="1.1.0" projectpath="startup"/>
      </files>
    </component>
