RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC55S69_system" Cversion="1.0.0" condition="device.LPC55S69_system.condition_id">
      <description>Device LPC55S69_system</description>
      <files>
        <file condition="allOf.cores=cm33, core_ids=cm33_core0.condition_id" category="sourceC" name="devices/LPC55S69/system_LPC55S69_cm33_core0.c" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core0.condition_id" category="header" name="devices/LPC55S69/system_LPC55S69_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core1.condition_id" category="sourceC" name="devices/LPC55S69/system_LPC55S69_cm33_core1.c" projectpath="device"/>
        <file condition="allOf.cores=cm33, core_ids=cm33_core1.condition_id" category="header" name="devices/LPC55S69/system_LPC55S69_cm33_core1.h" projectpath="device"/>
        <file condition="allOf.cores=cm33.condition_id" category="include" name="devices/LPC55S69/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="anactrl" Cversion="2.3.1" condition="driver.anactrl.condition_id">
      <description>anactrl Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_anactrl.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_anactrl.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.2.4" condition="driver.casper.condition_id">
      <description>CASPER Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_casper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_casper.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.3.3" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp_1" Cversion="2.2.1" condition="driver.cmp_1.condition_id">
      <description>cmp_1 Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="flexcomm_i2c_cmsis" Cversion="2.3.0" Capiversion="2.3.0" condition="driver.cmsis_flexcomm_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="flexcomm_spi_cmsis" Cversion="2.5.0" Capiversion="2.2.0" condition="driver.cmsis_flexcomm_spi.condition_id">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/cmsis_drivers/fsl_spi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/cmsis_drivers/fsl_spi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="flexcomm_usart_cmsis" Cversion="2.4.0" Capiversion="2.3.0" condition="driver.cmsis_flexcomm_usart.condition_id">
      <description>USART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/cmsis_drivers/fsl_usart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/cmsis_drivers/fsl_usart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/LPC55S69/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/LPC55S69/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.1" condition="driver.ctimer.condition_id">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_ctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_ctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.0" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="driver.flexcomm.condition_id">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_flexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_flexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.3" condition="driver.flexcomm_i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.3.1" condition="driver.flexcomm_i2c_dma.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_i2c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_i2c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s" Cversion="2.3.2" condition="driver.flexcomm_i2s.condition_id">
      <description>I2S Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_i2s.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_i2s.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2s_dma" Cversion="2.3.2" condition="driver.flexcomm_i2s_dma.condition_id">
      <description>I2S Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_i2s_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_i2s_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
