RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.1" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.1" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.3" condition="driver.flexcomm_usart.condition_id">
      <description>USART Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.6.0" condition="driver.flexcomm_usart_dma.condition_id">
      <description>USART Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fro_calib" Cversion="2.0.1" condition="driver.fro_calib.condition_id">
      <description>FRO calibration driver with calibration Lib</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_fro_calib.h" projectpath="LPC55S69/drivers"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0.condition_id" category="library" name="devices/LPC55S69/arm/keil_lib_fro_calib_cm33_core0.lib" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1.condition_id" category="library" name="devices/LPC55S69/arm/keil_lib_fro_calib_cm33_core1.lib" projectpath="LPC55S69/arm"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0.condition_id" category="library" name="devices/LPC55S69/iar/iar_lib_fro_calib_cm33_core0.a" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1.condition_id" category="library" name="devices/LPC55S69/iar/iar_lib_fro_calib_cm33_core1.a" projectpath="LPC55S69/iar"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0.condition_id" category="library" name="devices/LPC55S69/gcc/libfro_calib_hardabi.a" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0.condition_id" category="library" name="devices/LPC55S69/gcc/libfro_calib_softabi.a" projectpath="LPC55S69/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1.condition_id" category="library" name="devices/LPC55S69/gcc/libfro_calib_soft.a" projectpath="LPC55S69/gcc"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.1.0" condition="driver.gint.condition_id">
      <description>GINT Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_gint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_gint.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="hashcrypt" Cversion="2.2.14" condition="driver.hashcrypt.condition_id">
      <description>Hashcrypt Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_hashcrypt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_hashcrypt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap1" Cversion="2.1.5" condition="driver.iap1.condition_id">
      <description>FLASHIAP Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_iap.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_iap.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_iap_ffr.h" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_iap_kbp.h" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_iap_skboot_authenticate.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
