RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ili9341" Cversion="1.0.2" condition="driver.ili9341.condition_id">
      <description>Driver ili9341</description>
      <files>
        <file category="header" name="components/ili9341/fsl_ili9341.h" projectpath="lcd"/>
        <file category="sourceC" name="components/ili9341/fsl_ili9341.c" projectpath="lcd"/>
        <file category="include" name="components/ili9341/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.7" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.1" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_inputmux_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpadc" Cversion="2.8.4" condition="driver.lpadc.condition_id">
      <description>LPADC Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_lpadc.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_lpadc.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="driver.lpc_crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.1" condition="driver.lpc_dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="driver.lpc_gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.2.0" condition="driver.lpc_iocon.condition_id">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_iocon.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.2.0" condition="driver.lpc_rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mailbox" Cversion="2.3.1" condition="driver.mailbox.condition_id">
      <description>MAILBOX Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_mailbox.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/mma8652fc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.4" condition="driver.mrt.condition_id">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_mrt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_mrt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mx25r_flash" Cversion="2.0.0" condition="driver.mx25r_flash.condition_id">
      <description>Driver mx25r_flash</description>
      <files>
        <file category="header" name="components/mx25r_flash/mx25r_flash.h" projectpath="source"/>
        <file category="sourceC" name="components/mx25r_flash/mx25r_flash.c" projectpath="source"/>
        <file category="include" name="components/mx25r_flash/"/>
      </files>
    </component>
