RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nand_flash-common" Cversion="1.0.0" condition="driver.nand_flash-common.condition_id">
      <description>Driver nand_flash-common</description>
      <files>
        <file category="header" name="components/flash/nand/fsl_nand_flash.h" projectpath="nand_flash"/>
        <file category="include" name="components/flash/nand/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common" Cversion="1.0.0" condition="driver.nor_flash-common.condition_id">
      <description>Driver nor_flash-common</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash"/>
        <file category="include" name="components/flash/nor/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.1" condition="driver.ostimer.condition_id">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_ostimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_ostimer.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="header" name="components/pf1550/fsl_pf1550.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550.c" projectpath="pmic_driver"/>
        <file category="header" name="components/pf1550/fsl_pf1550_charger.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf1550/fsl_pf1550_charger.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="header" name="components/pf3000/fsl_pf3000.h" projectpath="pmic_driver"/>
        <file category="sourceC" name="components/pf3000/fsl_pf3000.c" projectpath="pmic_driver"/>
        <file category="include" name="components/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.1.12" condition="driver.pint.condition_id">
      <description>PINT Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_pint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_pint.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="plu" Cversion="2.2.1" condition="driver.plu.condition_id">
      <description>PLU Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_plu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_plu.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.3.0" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_power.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_power.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="powerquad" Cversion="2.2.0" condition="driver.powerquad.condition_id">
      <description>POWERQUAD Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_powerquad_data.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_data.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_powerquad.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_basic.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_math.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_matrix.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_filter.c" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_powerquad_transform.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PRINCE" Cversion="2.6.0" condition="driver.prince.condition_id">
      <description>PRINCE Driver</description>
      <RTE_Components_h>
#ifndef FFR_INCLUDE
#define FFR_INCLUDE "fsl_iap_ffr.h"
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_prince.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_prince.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUF" Cversion="2.1.6" condition="driver.puf.condition_id">
      <description>PUF Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_puf.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_puf.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
