RobertRostohar/NXP_Sensor_SDK/packs/LPC55S69_DFP/NXP.LPC55S69_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.1.2" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rng" Cversion="2.0.3" condition="driver.rng_1.condition_id">
      <description>RNG Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_rng.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_rng.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.4.9" condition="driver.sctimer.condition_id">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_sctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_sctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdif" Cversion="2.1.0" condition="driver.sdif.condition_id">
      <description>sdif Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_sdif.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC55S69/drivers/fsl_sdif.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sysctl" Cversion="2.0.5" condition="driver.sysctl.condition_id">
      <description>SYSCTL Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_sysctl.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_sysctl.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="utick" Cversion="2.0.5" condition="driver.utick.condition_id">
      <description>UTICK Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_utick.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_utick.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904" Cversion="2.5.1" condition="driver.wm8904.condition_id">
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8904/fsl_wm8904.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8904/fsl_wm8904.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8904/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960" Cversion="2.2.4" condition="driver.wm8960.condition_id">
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef SDK_I2C_BASED_COMPONENT_USED
#define SDK_I2C_BASED_COMPONENT_USED 1
#endif
#ifndef BOARD_USE_CODEC
#define BOARD_USE_CODEC 1
#endif
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/wm8960/fsl_wm8960.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/wm8960/fsl_wm8960.c" projectpath="codec"/>
        <file category="include" name="components/codec/wm8960/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.9" condition="driver.wwdt.condition_id">
      <description>WWDT Driver</description>
      <files>
        <file category="header" name="devices/LPC55S69/drivers/fsl_wwdt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC55S69/drivers/fsl_wwdt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC55S69/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/readme.txt" projectpath="middleware/bm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.</description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC55S69/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC55S69/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33.condition_id" category="sourceAsm" name="devices/LPC55S69/utilities/fsl_memcpy.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC55S69/utilities/debug_console/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/debug_console/fsl_debug_console.h" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/debug_console/fsl_debug_console_conf.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/str/"/>
        <file category="include" name="devices/LPC55S69/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC55S69/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/str/"/>
        <file category="include" name="devices/LPC55S69/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/LPC55S69/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <RTE_Components_h>
#ifndef DEBUG_CONSOLE_RX_ENABLE
#define DEBUG_CONSOLE_RX_ENABLE 0
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="sourceC" name="devices/LPC55S69/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/LPC55S69/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="include" name="devices/LPC55S69/utilities/str/"/>
      </files>
    </component>
  </components>
</package>
